<a href="https://colab.research.google.com/github/mahluwal/Tensorflow/blob/master/Springboard_Test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
data = pd.read_csv("titanic.csv")

In [ ]:
data

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [ ]:
import pandas as pd
from scipy.stats import chi2_contingency

table = pd.crosstab(data['Pclass'],data['Survived'])
print(table)

Survived    0    1
Pclass
1          80  136
2          97   87
3         368  119

In [ ]:
table = pd.crosstab(data['Sex'],data['Survived'])
print(table)

Survived    0    1
Sex
female     81  233
male      464  109

In [ ]:
table = pd.crosstab(data['Sex'],data['Pclass'])
print(table)

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  343

In [ ]:
sur = 0
nsur = 0
for i in range(len(data)):
    if(data["Sex"][i] == "female" and data["Pclass"][i] == 3):
        if(data["Survived"][i] == 1):
            sur = sur+1
        if(data["Survived"][i] == 0):
            nsur = nsur+1
print("sur", sur)
print("nsur", nsur)

sur 72
nsur 72

In [ ]:
sur

45

In [ ]:
nsur

77